; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos) 
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-6-6-4-6-6)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos0-5 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos1-5 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5 pos3-0 pos3-1 pos3-2 pos3-3 pos3-4 pos3-5 pos4-0 pos4-1 pos4-2 pos4-3 pos4-4 pos4-5 pos5-0 pos5-1 pos5-2 pos5-3 pos5-4 pos5-5
    shape0 shape1 shape2 shape3
    key0 key1 key2 key3 key4 key5
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos0-5)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos1-5)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (place pos2-5)
       (place pos3-0)
       (place pos3-1)
       (place pos3-2)
       (place pos3-3)
       (place pos3-4)
       (place pos3-5)
       (place pos4-0)
       (place pos4-1)
       (place pos4-2)
       (place pos4-3)
       (place pos4-4)
       (place pos4-5)
       (place pos5-0)
       (place pos5-1)
       (place pos5-2)
       (place pos5-3)
       (place pos5-4)
       (place pos5-5)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (shape shape3)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-5)
       (conn pos0-4 pos0-3)
       (conn pos0-5 pos1-5)
       (conn pos0-5 pos0-4)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos1-5)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos1-5 pos2-5)
       (conn pos1-5 pos0-5)
       (conn pos1-5 pos1-4)
       (conn pos2-0 pos3-0)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos3-1)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos3-2)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos3-3)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos3-4)
       (conn pos2-4 pos2-5)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (conn pos2-5 pos3-5)
       (conn pos2-5 pos1-5)
       (conn pos2-5 pos2-4)
       (conn pos3-0 pos4-0)
       (conn pos3-0 pos3-1)
       (conn pos3-0 pos2-0)
       (conn pos3-1 pos4-1)
       (conn pos3-1 pos3-2)
       (conn pos3-1 pos2-1)
       (conn pos3-1 pos3-0)
       (conn pos3-2 pos4-2)
       (conn pos3-2 pos3-3)
       (conn pos3-2 pos2-2)
       (conn pos3-2 pos3-1)
       (conn pos3-3 pos4-3)
       (conn pos3-3 pos3-4)
       (conn pos3-3 pos2-3)
       (conn pos3-3 pos3-2)
       (conn pos3-4 pos4-4)
       (conn pos3-4 pos3-5)
       (conn pos3-4 pos2-4)
       (conn pos3-4 pos3-3)
       (conn pos3-5 pos4-5)
       (conn pos3-5 pos2-5)
       (conn pos3-5 pos3-4)
       (conn pos4-0 pos5-0)
       (conn pos4-0 pos4-1)
       (conn pos4-0 pos3-0)
       (conn pos4-1 pos5-1)
       (conn pos4-1 pos4-2)
       (conn pos4-1 pos3-1)
       (conn pos4-1 pos4-0)
       (conn pos4-2 pos5-2)
       (conn pos4-2 pos4-3)
       (conn pos4-2 pos3-2)
       (conn pos4-2 pos4-1)
       (conn pos4-3 pos5-3)
       (conn pos4-3 pos4-4)
       (conn pos4-3 pos3-3)
       (conn pos4-3 pos4-2)
       (conn pos4-4 pos5-4)
       (conn pos4-4 pos4-5)
       (conn pos4-4 pos3-4)
       (conn pos4-4 pos4-3)
       (conn pos4-5 pos5-5)
       (conn pos4-5 pos3-5)
       (conn pos4-5 pos4-4)
       (conn pos5-0 pos5-1)
       (conn pos5-0 pos4-0)
       (conn pos5-1 pos5-2)
       (conn pos5-1 pos4-1)
       (conn pos5-1 pos5-0)
       (conn pos5-2 pos5-3)
       (conn pos5-2 pos4-2)
       (conn pos5-2 pos5-1)
       (conn pos5-3 pos5-4)
       (conn pos5-3 pos4-3)
       (conn pos5-3 pos5-2)
       (conn pos5-4 pos5-5)
       (conn pos5-4 pos4-4)
       (conn pos5-4 pos5-3)
       (conn pos5-5 pos4-5)
       (conn pos5-5 pos5-4)
       (locked pos0-1)
       (locked pos1-4)
       (locked pos5-3)
       (locked pos1-5)
       (locked pos4-1)
       (locked pos0-5)
       (lock-shape  pos0-1 shape0)
       (lock-shape  pos1-4 shape1)
       (lock-shape  pos5-3 shape2)
       (lock-shape  pos1-5 shape3)
       (lock-shape  pos4-1 shape1)
       (lock-shape  pos0-5 shape3)
       (open pos0-0)
       (open pos0-2)
       (open pos0-3)
       (open pos0-4)
       (open pos1-0)
       (open pos1-1)
       (open pos1-2)
       (open pos1-3)
       (open pos2-0)
       (open pos2-1)
       (open pos2-2)
       (open pos2-3)
       (open pos2-4)
       (open pos2-5)
       (open pos3-0)
       (open pos3-1)
       (open pos3-2)
       (open pos3-3)
       (open pos3-4)
       (open pos3-5)
       (open pos4-0)
       (open pos4-2)
       (open pos4-3)
       (open pos4-4)
       (open pos4-5)
       (open pos5-0)
       (open pos5-1)
       (open pos5-2)
       (open pos5-4)
       (open pos5-5)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape3)
       (key-shape  key4 shape2)
       (key-shape  key5 shape3)
       (at key0 pos2-2)
       (at key1 pos5-1)
       (at key2 pos5-1)
       (at key3 pos2-1)
       (at key4 pos1-1)
       (at key5 pos4-3)
       (at-robot pos2-2)
    )

    (:goal (and
       (at key0 pos5-2)
       (at key1 pos4-0)
       (at key2 pos0-4)
       (at key3 pos2-5)
       (at key4 pos4-1)
       (at key5 pos4-5)
    )))

; plan
1. (move pos2-2 pos3-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos3-2)
   goals met: 0 of 6
2. (move pos3-2 pos4-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos4-2)
   goals met: 0 of 6
3. (move pos4-2 pos5-2)
   deleted: (at-robot pos4-2)
   added: (at-robot pos5-2)
   goals met: 0 of 6
4. (move pos5-2 pos5-1)
   deleted: (at-robot pos5-2)
   added: (at-robot pos5-1)
   goals met: 0 of 6
5. (pickup pos5-1 key1)
   deleted: (at key1 pos5-1) (arm-empty)
   added: (holding key1)
   goals met: 0 of 6
6. (unlock pos5-1 pos4-1 key1 shape1)
   deleted: (locked pos4-1)
   added: (open pos4-1)
   goals met: 0 of 6
7. (move pos5-1 pos5-2)
   deleted: (at-robot pos5-1)
   added: (at-robot pos5-2)
   goals met: 0 of 6
8. (move pos5-2 pos4-2)
   deleted: (at-robot pos5-2)
   added: (at-robot pos4-2)
   goals met: 0 of 6
9. (move pos4-2 pos4-1)
   deleted: (at-robot pos4-2)
   added: (at-robot pos4-1)
   goals met: 0 of 6
10. (move pos4-1 pos4-0)
   deleted: (at-robot pos4-1)
   added: (at-robot pos4-0)
   goals met: 0 of 6
11. (putdown pos4-0 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 pos4-0)
   goals met: 1 of 6
12. (move pos4-0 pos4-1)
   deleted: (at-robot pos4-0)
   added: (at-robot pos4-1)
   goals met: 1 of 6
13. (move pos4-1 pos4-2)
   deleted: (at-robot pos4-1)
   added: (at-robot pos4-2)
   goals met: 1 of 6
14. (move pos4-2 pos4-3)
   deleted: (at-robot pos4-2)
   added: (at-robot pos4-3)
   goals met: 1 of 6
15. (pickup pos4-3 key5)
   deleted: (at key5 pos4-3) (arm-empty)
   added: (holding key5)
   goals met: 1 of 6
16. (move pos4-3 pos4-2)
   deleted: (at-robot pos4-3)
   added: (at-robot pos4-2)
   goals met: 1 of 6
17. (move pos4-2 pos4-1)
   deleted: (at-robot pos4-2)
   added: (at-robot pos4-1)
   goals met: 1 of 6
18. (move pos4-1 pos3-1)
   deleted: (at-robot pos4-1)
   added: (at-robot pos3-1)
   goals met: 1 of 6
19. (move pos3-1 pos2-1)
   deleted: (at-robot pos3-1)
   added: (at-robot pos2-1)
   goals met: 1 of 6
20. (putdown pos2-1 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos2-1)
   goals met: 1 of 6
21. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 1 of 6
22. (pickup pos1-1 key4)
   deleted: (at key4 pos1-1) (arm-empty)
   added: (holding key4)
   goals met: 1 of 6
23. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 1 of 6
24. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 1 of 6
25. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 1 of 6
26. (move pos2-3 pos2-4)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-4)
   goals met: 1 of 6
27. (move pos2-4 pos2-5)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-5)
   goals met: 1 of 6
28. (move pos2-5 pos3-5)
   deleted: (at-robot pos2-5)
   added: (at-robot pos3-5)
   goals met: 1 of 6
29. (move pos3-5 pos4-5)
   deleted: (at-robot pos3-5)
   added: (at-robot pos4-5)
   goals met: 1 of 6
30. (putdown pos4-5 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 pos4-5)
   goals met: 1 of 6
31. (move pos4-5 pos4-4)
   deleted: (at-robot pos4-5)
   added: (at-robot pos4-4)
   goals met: 1 of 6
32. (move pos4-4 pos4-3)
   deleted: (at-robot pos4-4)
   added: (at-robot pos4-3)
   goals met: 1 of 6
33. (move pos4-3 pos4-2)
   deleted: (at-robot pos4-3)
   added: (at-robot pos4-2)
   goals met: 1 of 6
34. (move pos4-2 pos5-2)
   deleted: (at-robot pos4-2)
   added: (at-robot pos5-2)
   goals met: 1 of 6
35. (move pos5-2 pos5-1)
   deleted: (at-robot pos5-2)
   added: (at-robot pos5-1)
   goals met: 1 of 6
36. (pickup pos5-1 key2)
   deleted: (at key2 pos5-1) (arm-empty)
   added: (holding key2)
   goals met: 1 of 6
37. (move pos5-1 pos5-2)
   deleted: (at-robot pos5-1)
   added: (at-robot pos5-2)
   goals met: 1 of 6
38. (move pos5-2 pos4-2)
   deleted: (at-robot pos5-2)
   added: (at-robot pos4-2)
   goals met: 1 of 6
39. (move pos4-2 pos3-2)
   deleted: (at-robot pos4-2)
   added: (at-robot pos3-2)
   goals met: 1 of 6
40. (move pos3-2 pos2-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos2-2)
   goals met: 1 of 6
41. (putdown pos2-2 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos2-2)
   goals met: 1 of 6
42. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 1 of 6
43. (move pos2-3 pos2-4)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-4)
   goals met: 1 of 6
44. (move pos2-4 pos2-5)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-5)
   goals met: 1 of 6
45. (move pos2-5 pos3-5)
   deleted: (at-robot pos2-5)
   added: (at-robot pos3-5)
   goals met: 1 of 6
46. (move pos3-5 pos4-5)
   deleted: (at-robot pos3-5)
   added: (at-robot pos4-5)
   goals met: 1 of 6
47. (pickup pos4-5 key4)
   deleted: (at key4 pos4-5) (arm-empty)
   added: (holding key4)
   goals met: 1 of 6
48. (move pos4-5 pos4-4)
   deleted: (at-robot pos4-5)
   added: (at-robot pos4-4)
   goals met: 1 of 6
49. (move pos4-4 pos4-3)
   deleted: (at-robot pos4-4)
   added: (at-robot pos4-3)
   goals met: 1 of 6
50. (move pos4-3 pos4-2)
   deleted: (at-robot pos4-3)
   added: (at-robot pos4-2)
   goals met: 1 of 6
51. (move pos4-2 pos4-1)
   deleted: (at-robot pos4-2)
   added: (at-robot pos4-1)
   goals met: 1 of 6
52. (putdown pos4-1 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 pos4-1)
   goals met: 2 of 6
53. (move pos4-1 pos4-2)
   deleted: (at-robot pos4-1)
   added: (at-robot pos4-2)
   goals met: 2 of 6
54. (move pos4-2 pos3-2)
   deleted: (at-robot pos4-2)
   added: (at-robot pos3-2)
   goals met: 2 of 6
55. (move pos3-2 pos2-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos2-2)
   goals met: 2 of 6
56. (pickup pos2-2 key2)
   deleted: (at key2 pos2-2) (arm-empty)
   added: (holding key2)
   goals met: 2 of 6
57. (pickup-and-loose pos2-2 key0 key2)
   deleted: (holding key2) (at key0 pos2-2)
   added: (holding key0) (at key2 pos2-2)
   goals met: 2 of 6
58. (move pos2-2 pos3-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos3-2)
   goals met: 2 of 6
59. (move pos3-2 pos4-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos4-2)
   goals met: 2 of 6
60. (move pos4-2 pos5-2)
   deleted: (at-robot pos4-2)
   added: (at-robot pos5-2)
   goals met: 2 of 6
61. (putdown pos5-2 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos5-2)
   goals met: 3 of 6
62. (move pos5-2 pos4-2)
   deleted: (at-robot pos5-2)
   added: (at-robot pos4-2)
   goals met: 3 of 6
63. (move pos4-2 pos4-3)
   deleted: (at-robot pos4-2)
   added: (at-robot pos4-3)
   goals met: 3 of 6
64. (move pos4-3 pos3-3)
   deleted: (at-robot pos4-3)
   added: (at-robot pos3-3)
   goals met: 3 of 6
65. (move pos3-3 pos3-4)
   deleted: (at-robot pos3-3)
   added: (at-robot pos3-4)
   goals met: 3 of 6
66. (move pos3-4 pos3-5)
   deleted: (at-robot pos3-4)
   added: (at-robot pos3-5)
   goals met: 3 of 6
67. (move pos3-5 pos2-5)
   deleted: (at-robot pos3-5)
   added: (at-robot pos2-5)
   goals met: 3 of 6
68. (move pos2-5 pos2-4)
   deleted: (at-robot pos2-5)
   added: (at-robot pos2-4)
   goals met: 3 of 6
69. (move pos2-4 pos2-3)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-3)
   goals met: 3 of 6
70. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 3 of 6
71. (pickup pos2-2 key2)
   deleted: (at key2 pos2-2) (arm-empty)
   added: (holding key2)
   goals met: 3 of 6
72. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 3 of 6
73. (move pos2-3 pos1-3)
   deleted: (at-robot pos2-3)
   added: (at-robot pos1-3)
   goals met: 3 of 6
74. (move pos1-3 pos0-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos0-3)
   goals met: 3 of 6
75. (move pos0-3 pos0-4)
   deleted: (at-robot pos0-3)
   added: (at-robot pos0-4)
   goals met: 3 of 6
76. (putdown pos0-4 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos0-4)
   goals met: 4 of 6
77. (move pos0-4 pos0-3)
   deleted: (at-robot pos0-4)
   added: (at-robot pos0-3)
   goals met: 4 of 6
78. (move pos0-3 pos1-3)
   deleted: (at-robot pos0-3)
   added: (at-robot pos1-3)
   goals met: 4 of 6
79. (move pos1-3 pos2-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos2-3)
   goals met: 4 of 6
80. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 4 of 6
81. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 4 of 6
82. (pickup pos2-1 key5)
   deleted: (at key5 pos2-1) (arm-empty)
   added: (holding key5)
   goals met: 4 of 6
83. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 4 of 6
84. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 4 of 6
85. (putdown pos2-3 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos2-3)
   goals met: 4 of 6
86. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 4 of 6
87. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 4 of 6
88. (pickup pos2-1 key3)
   deleted: (at key3 pos2-1) (arm-empty)
   added: (holding key3)
   goals met: 4 of 6
89. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 4 of 6
90. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 4 of 6
91. (move pos2-3 pos2-4)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-4)
   goals met: 4 of 6
92. (move pos2-4 pos2-5)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-5)
   goals met: 4 of 6
93. (putdown pos2-5 key3)
   deleted: (holding key3)
   added: (arm-empty) (at key3 pos2-5)
   goals met: 5 of 6
94. (move pos2-5 pos2-4)
   deleted: (at-robot pos2-5)
   added: (at-robot pos2-4)
   goals met: 5 of 6
95. (move pos2-4 pos2-3)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-3)
   goals met: 5 of 6
96. (pickup pos2-3 key5)
   deleted: (at key5 pos2-3) (arm-empty)
   added: (holding key5)
   goals met: 5 of 6
97. (move pos2-3 pos2-4)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-4)
   goals met: 5 of 6
98. (move pos2-4 pos2-5)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-5)
   goals met: 5 of 6
99. (move pos2-5 pos3-5)
   deleted: (at-robot pos2-5)
   added: (at-robot pos3-5)
   goals met: 5 of 6
100. (move pos3-5 pos4-5)
   deleted: (at-robot pos3-5)
   added: (at-robot pos4-5)
   goals met: 5 of 6
101. (putdown pos4-5 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos4-5)
   goals met: 6 of 6
